# 1. Приветствие
# Напишите программу, которая выводит на экран строку "Hello, Python!".
# Пример вывода:
# Hello, Python!

# print ("Hello, Pyton!")

# 2. Вывод имени пользователя
# Напишите программу, которая попросит пользователя ввести его имя, а затем
# выведет его на экран.
# Пример вывода:
# Введите ваше имя:
# Имя

# name = input("Введите ваше имя: ")
# print (name)

# 3. Личное досье
# Напишите программу, которая запрашивает у пользователя его имя, возраст и город
# проживания, а затем выводит их в формате одной строки.
# Пример вывода:
# Введите имя: Алиса
# Введите возраст: 25
# Введите город: Париж
# Алиса 25 лет, проживает в городе Париж

# name = input ('Введите имя: ')
# age = input ('Введите возраст: ')
# city = input ('Введите город: ')
# print (name, age + ' лет,', 'проживает в городе ' + city, end=' ')

# 4. Повторитель текста
# Напишите программу, которая принимает от пользователя строку текста и выводит
# её трижды, каждую строку с новой строки.
# Пример вывода:
# Введите текст: Привет
# Привет
# Привет
# Привет

# text = input ('Введите текст: ')
# print ((text + '\n') * 3)